Tekla.Structures.ModelInternal.Dstv.HeaderRow
The class used to create a row in header order list.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.Items
The list of items.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.#ctor
Creates a new HeaderRow instance.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.#ctor(System.String)
Creates a new HeaderRow instance using an item as input.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.#ctor(System.Collections.Generic.List{System.String})
Creates a new HeaderRow instance using a list of items as input.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.AddItem(System.String)
Adds an item to the header row.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.Add(System.Collections.Generic.List{System.String})
Adds a list of items to the header row.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.Add(System.String[])
Adds an array of items to the header row.

Tekla.Structures.ModelInternal.Dstv.HeaderRow.GetRowItems
Returns the list of items from the header row.